Renova/src/Documents/ОтчетОПроизводстве/ОтчетОПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПроизводстве</name>
  <registerRecords>AccumulationRegister.Производство</registerRecords>
  <attributes>
    <name>СписокВидовПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ВидыПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/AccumulationRegisters/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Производство</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПродано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПроизведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоделиПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Renova/src/Documents/ОтчетОПроизводстве/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяУниверсальнаяДата());
		КонецПериода = НачалоПериода;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

    // Получаем соответствие запрещенных комбинаций (ключ -> дата более позднего документа)
    ЗапрещенныеКомбинации = ПолучитьЗапрещенныеКомбинации();

    // Начинаем формирование движений
    Движения.Производство.Записывать = Истина;

    КоличествоЗапрещено = 0;
    КоличествоПерезаписано = 0;

    Для Каждого ТекСтрокаТовары Из Товары Цикл

        // Пропускаем строки с незаполненными обязательными реквизитами
        Если Не ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) Или
           Не ЗначениеЗаполнено(ТекСтрокаТовары.Количество) Тогда
            Продолжить;
        КонецЕсли;
		
		Если ЗапрещенныеКомбинации.Количество() > 0 Тогда
			// Формируем ключ для проверки (единый формат для обеих сторон)
			Ключ = Строка(ТекСтрокаТовары.Номенклатура) + "|" + Формат(ТекСтрокаТовары.МесяцПроизводства, "ДФ=yyyyMMdd");
		КонецЕсли;
		
        // Проверяем, есть ли более поздняя запись в регистре
        Если ЗапрещенныеКомбинации.Получить(Ключ) <> Неопределено Тогда
            Текст = """Строка по модели " + ТекСтрокаТовары.Номенклатура +
                      " за месяц " + Формат(ТекСтрокаТовары.МесяцПроизводства, "ДФ='MMMM yyyy';") +
                      " НЕ БУДЕТ ЗАПИСАНА, так как имеются более поздние данные (документ от " +
                      Формат(ЗапрещенныеКомбинации[Ключ], "Д") + ").""";
            Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = Текст;
			Сообщение.Сообщить();  
            КоличествоЗапрещено = КоличествоЗапрещено + 1;
            Продолжить;
        КонецЕсли;

        // Создаём движение
		Движение = Движения.Производство.Добавить();
		Движение.Период = Дата;
		Движение.МесяцПроизводства = ТекСтрокаТовары.МесяцПроизводства; 
		Движение.ВидПродукции = ТекСтрокаТовары.ВидПродукции;
		Движение.МоделиПродукции = ТекСтрокаТовары.Номенклатура;
		Движение.Фабрика = Фабрика;    
		Движение.КоличествоПроизведено = ТекСтрокаТовары.Количество;

        КоличествоПерезаписано = КоличествоПерезаписано + 1;

    КонецЦикла;

    // Выводим итоговые сообщения
    Если КоличествоЗапрещено > 0 Тогда
        ТекстПропущено = """Внимание! Было пропущено " + КоличествоЗапрещено + " строк(и) из-за наличия более поздних записей.""";
        Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстПропущено;
		Сообщение.Сообщить();
    КонецЕсли;

    Если КоличествоПерезаписано > 0 Тогда
    	Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = """Записано " + КоличествоПерезаписано + " строк(и). Старые данные (если были) перезаписаны.""";
		Сообщение.Сообщить();
    Иначе
        Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет данных для проведения документа";
		Сообщение.Сообщить();
		Отказ = Истина;
    КонецЕсли;
	
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

Функция ПолучитьЗапрещенныеКомбинации() Экспорт 
	
  	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	МассивМесяцев = Товары.ВыгрузитьКолонку("МесяцПроизводства");

    // Запрос к регистру для получения максимальной даты документа по каждой комбинации
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Производство.МоделиПродукции КАК МоделиПродукции,
	               |	Производство.МесяцПроизводства КАК МесяцПроизводства,
	               |	МАКСИМУМ(Производство.Период) КАК Период
	               |ИЗ
	               |	РегистрНакопления.Производство КАК Производство
	               |ГДЕ
	               |	Производство.МоделиПродукции В(&Модель)
	               |	И Производство.МесяцПроизводства В(&Месяц)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Производство.МесяцПроизводства,
	               |	Производство.МоделиПродукции"; 
	
    Запрос.УстановитьПараметр("Модель", МассивНоменклатуры);
    Запрос.УстановитьПараметр("Месяц", МассивМесяцев);

    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    Запрет = Новый Соответствие;
    Пока Выборка.Следующий() Цикл
        Если Выборка.Период > Ссылка.Дата Тогда
            Ключ = Строка(Выборка.МоделиПродукции) + "|" + Формат(Выборка.МесяцПроизводства, "ДФ=yyyyMMdd");
            Запрет.Вставить(Ключ, Выборка.Период);
        КонецЕсли;
    КонецЦикла;

    Возврат Запрет;	
	
КонецФункции

#КонецОбласти
#КонецЕсли
